app/controllers/damages_controller.rb

SELECT "damages".* FROM "damages"
---
  def index
    @damages = Damage.all