app/controllers/lots_controller.rb

  def index
    @lots = Lot.all
---
SELECT "lots".* FROM "lots"