app/controllers/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["salt", "yS3J4jGodGcLXoEPGXz_"], ["crypted_password", "$2a$10$e.uu/N7l2eikiTsPb4YOneiK1pMONhXiQVXdDkMAaSCeEz9Ilazuu"], ["updated_at", "2018-12-28 07:57:47.112474"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)