app/controllers/varieties_controller.rb

  def index
    @varieties = Variety.all
---
SELECT "varieties".* FROM "varieties"